Public Member Functions | Protected Attributes | Friends | List of all members
ACAPI::v1::Object Class Reference
API Infrastructure
A base class for all ACAPI objects. Purely technical. More...
#include <Object.hpp>
 Inheritance diagram for ACAPI::v1::Object:
 Public Member Functions
Object (std::shared_ptr< Impl::ObjectImpl > impl)
 const API_Token &  | GetToken () const
 Protected Attributes
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
 Friends
 class  | Impl::UsageLogger
 template<class T >
class  | Impl::ImplAccessor
Detailed Description
A base class for all ACAPI objects. Purely technical.